In [2]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)

2.2.2

In [4]:
months = ['jan','feb','mar']
passengers =  np.array([122,118,132])
print(type(passengers))

<class 'numpy.ndarray'>

In [5]:
series =pd.Series(passengers, index=months) # USE CAPITAL"S" FOR "SERIES" ATTRIBUITE
print(series)

jan    122
feb    118
mar    132
dtype: int32

In [6]:
print(series['jan'])

122

In [7]:
series_1949 = pd.Series([112,118],index=['jan','feb'])
series_1950 = pd.Series([112,126],index=['jan','mar'])
print(series_1950)
print(series_1949)

jan    112
mar    126
dtype: int64
jan    112
feb    118
dtype: int64

In [8]:
total = series_1949+series_1950
print(total)

feb      NaN
jan    224.0
mar      NaN
dtype: float64

2D Dimensional Data frame

In [9]:
df = pd.read_csv(r'C:\Users\mccmrfcs\Downloads\AirPassengers.csv')

print(df)

       Month  Passengers
0    1949-01         112
1    1949-02         118
2    1949-03         132
3    1949-04         129
4    1949-05         121
..       ...         ...
139  1960-08         606
140  1960-09         508
141  1960-10         461
142  1960-11         390
143  1960-12         432

[144 rows x 2 columns]

In [10]:
print(df.head())
print(df.tail())

     Month  Passengers
0  1949-01         112
1  1949-02         118
2  1949-03         132
3  1949-04         129
4  1949-05         121
       Month  Passengers
139  1960-08         606
140  1960-09         508
141  1960-10         461
142  1960-11         390
143  1960-12         432

In [11]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
print(df)

          W         X         Y         Z
A  0.621011 -0.389656 -0.827312  2.351165
B  1.182485  0.001429 -0.205682 -0.364082
C -0.548429 -0.925329 -0.142679 -0.631057
D  0.426529  0.142472  0.373703 -0.588073
E -1.789936 -0.292063  0.353138  0.206805

In [12]:
df.drop('W',axis=1)  #TO DROP A COLUMN USE AXIS=1

          X         Y         Z
A -0.389656 -0.827312  2.351165
B  0.001429 -0.205682 -0.364082
C -0.925329 -0.142679 -0.631057
D  0.142472  0.373703 -0.588073
E -0.292063  0.353138  0.206805

In [13]:
df.drop('A',axis=0) #TO DROP A ROW USE AXIS=0

          W         X         Y         Z
B  1.182485  0.001429 -0.205682 -0.364082
C -0.548429 -0.925329 -0.142679 -0.631057
D  0.426529  0.142472  0.373703 -0.588073
E -1.789936 -0.292063  0.353138  0.206805

In [14]:
df['Y+Z']=df['W']+df['X']# TO CREATE A NEW COLUMN WITH THE ADDITION OF TWO COLUMNS
print(df)

          W         X         Y         Z       Y+Z
A  0.621011 -0.389656 -0.827312  2.351165  0.231355
B  1.182485  0.001429 -0.205682 -0.364082  1.183914
C -0.548429 -0.925329 -0.142679 -0.631057 -1.473758
D  0.426529  0.142472  0.373703 -0.588073  0.569001
E -1.789936 -0.292063  0.353138  0.206805 -2.081999

In [16]:
df.describe()

              W         X         Y         Z       Y+Z
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean  -0.021668 -0.292629 -0.089766  0.194952 -0.314298
std    1.169204  0.413977  0.492742  1.250733  1.395682
min   -1.789936 -0.925329 -0.827312 -0.631057 -2.081999
25%   -0.548429 -0.389656 -0.205682 -0.588073 -1.473758
50%    0.426529 -0.292063 -0.142679 -0.364082  0.231355
75%    0.621011  0.001429  0.353138  0.206805  0.569001
max    1.182485  0.142472  0.373703  2.351165  1.183914

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
 4   Y+Z     5 non-null      float64
dtypes: float64(5)
memory usage: 412.0+ bytes

In [19]:
df.dtypes

W      float64
X      float64
Y      float64
Z      float64
Y+Z    float64
dtype: object